const BleCodes = {
    1001: "开始蓝牙配对",
    1002: "蓝牙配对成功",
    1003: "蓝牙配对失败",
    1004: "蓝牙未开启",
    1005: "蓝牙未授权",
    1006: "定位未开启",
    1007: "定位未授权",
    1101: "打开蓝牙适配器",
    1102: "蓝牙适配器打开成功",
    1103: "蓝牙适配器打开失败",
    1104: "关闭蓝牙适配器",
    1105: "蓝牙适配器状态变化",
    1106: "获取蓝牙适配器状态",
    1201: "开始扫描蓝牙设备",
    1202: "扫描蓝牙设备成功",
    1203: "扫描蓝牙设备失败",
    1204: "扫描到蓝牙设备",
    1205: "未扫描到蓝牙设备",
    1301: "开始蓝牙BLE连接",
    1302: "蓝牙BLE连接成功",
    1303: "蓝牙BLE连接失败",
    1311: "开始蓝牙BLE断连",
    1312: "蓝牙BLE断开成功",
    1313: "蓝牙BLE断连失败",
    1314: "蓝牙断开连接",
    1401: "获取蓝牙服务",
    1402: "获取到的蓝牙服务",
    1403: "获取蓝牙服务失败",
    1501: "获取特征值",
    1502: "获取特征值成功",
    1503: "获取特征值失败",
    1601: "订阅特征值",
    1602: "订阅特征值成功",
    1603: "订阅特征值失败",
    1701: "featureExchange",
    1702: "featureExchange成功",
    1703: "featureExchange失败",
    1801: "rtc校准",
    1802: "rtc校准成功",
    1803: "rtc校准失败",
    1901: "蓝牙认证",
    1902: "蓝牙认证成功（蓝牙连接成功）",
    1903: "蓝牙认证失败",
    2003: "钥匙不可用",
    2100: "车况数据返回",
    2202: "车控命令执行成功",
    2203: "车控命令执行失败",
    2204: "车控命令写入成功",
    2205: "车控命令写入失败",
    2206: "车控命令写入",
    2301: "车控版本返回",
    2302: "rtc校验方式返回",
    2303: "车控命令执行结果返回",
}
//蓝牙连接错误码集合
const BleConnectErrCode = [
    1003, 1004, 1005, 1006, 1007, 1103, 1203, 1303, 1403, 1503, 1603, 1703, 1803, 1903, 2003
]

/**
 * 自动重连错误码
 */
const AutoRetryErrors = [
    1003, 1103, 1203, 1303, 1403, 1503, 1603, 1703, 1803, 1903, 2003
]

const CarrierCodes = {
    2101:"获取mqtt连接信息",
    2102:"获取mqtt连接信息成功",
    2103:"获取mqtt连接信息失败",
    2201:"开始连接mqtt",
    2202:"连接mqtt成功",
    2203:"连接mqtt失败",
    2204:"重连mqtt",
    2206:"订阅成功（4g连接成功）",
    2207:"订阅失败",
    2208:"发送车控命令"
}
const CarrierConnectErrCode = [
    2103, 2203, 2207
]

export {
    BleCodes,
    BleConnectErrCode,
    CarrierCodes,
    CarrierConnectErrCode,
    AutoRetryErrors
}